espressif/arduino-esp32/boards.txt
Ticos-kit-longan.menu.FlashSize.4M=4MB (32Mb)
Ticos-kit-longan.menu.FlashSize.4M.build.flash_size=4MB
Ticos-kit-longan.menu.FlashSize.8M=8MB (64Mb)
Ticos-kit-longan.menu.FlashSize.8M.build.flash_size=8MB
Ticos-kit-longan.menu.FlashSize.8M.build.partitions=default_8MB
Ticos-kit-longan.menu.FlashSize.2M=2MB (16Mb)
Ticos-kit-longan.menu.FlashSize.2M.build.flash_size=2MB
Ticos-kit-longan.menu.FlashSize.2M.build.partitions=minimal
Ticos-kit-longan.menu.FlashSize.16M=16MB (128Mb)
Ticos-kit-longan.menu.FlashSize.16M.build.flash_size=16MB

Ticos-kit-longan.menu.UploadSpeed.921600=921600
Ticos-kit-longan.menu.UploadSpeed.921600.upload.speed=921600
Ticos-kit-longan.menu.UploadSpeed.115200=115200
Ticos-kit-longan.menu.UploadSpeed.115200.upload.speed=115200
Ticos-kit-longan.menu.UploadSpeed.256000.windows=256000
Ticos-kit-longan.menu.UploadSpeed.256000.upload.speed=256000
Ticos-kit-longan.menu.UploadSpeed.230400.windows.upload.speed=256000
Ticos-kit-longan.menu.UploadSpeed.230400=230400
Ticos-kit-longan.menu.UploadSpeed.230400.upload.speed=230400
Ticos-kit-longan.menu.UploadSpeed.460800.linux=460800
Ticos-kit-longan.menu.UploadSpeed.460800.macosx=460800
Ticos-kit-longan.menu.UploadSpeed.460800.upload.speed=460800
Ticos-kit-longan.menu.UploadSpeed.512000.windows=512000
Ticos-kit-longan.menu.UploadSpeed.512000.upload.speed=512000

Ticos-kit-longan.menu.DebugLevel.none=None
Ticos-kit-longan.menu.DebugLevel.none.build.code_debug=0
Ticos-kit-longan.menu.DebugLevel.error=Error
Ticos-kit-longan.menu.DebugLevel.error.build.code_debug=1
Ticos-kit-longan.menu.DebugLevel.warn=Warn
Ticos-kit-longan.menu.DebugLevel.warn.build.code_debug=2
Ticos-kit-longan.menu.DebugLevel.info=Info
Ticos-kit-longan.menu.DebugLevel.info.build.code_debug=3
Ticos-kit-longan.menu.DebugLevel.debug=Debug
Ticos-kit-longan.menu.DebugLevel.debug.build.code_debug=4
Ticos-kit-longan.menu.DebugLevel.verbose=Verbose
Ticos-kit-longan.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

ticos-kit-orange.name=Ticos Kit Orange
ticos-kit-orange.vid.0=0x303a
ticos-kit-orange.pid.0=0x1001

ticos-kit-orange.bootloader.tool=esptool_py
ticos-kit-orange.bootloader.tool.default=esptool_py

ticos-kit-orange.upload.tool=esptool_py
ticos-kit-orange.upload.tool.default=esptool_py
ticos-kit-orange.upload.tool.network=esp_ota

ticos-kit-orange.upload.maximum_size=1310720
ticos-kit-orange.upload.maximum_data_size=327680
ticos-kit-orange.upload.flags=
ticos-kit-orange.upload.extra_flags=
ticos-kit-orange.upload.use_1200bps_touch=false
ticos-kit-orange.upload.wait_for_upload_port=false

ticos-kit-orange.serial.disableDTR=false
ticos-kit-orange.serial.disableRTS=false

ticos-kit-orange.build.tarch=riscv32
ticos-kit-orange.build.target=esp
ticos-kit-orange.build.mcu=esp32c3
ticos-kit-orange.build.core=esp32
ticos-kit-orange.build.variant=ticos-kit-orange
ticos-kit-orange.build.board=ticos-kit-orange
ticos-kit-orange.build.bootloader_addr=0x0

ticos-kit-orange.build.cdc_on_boot=0
ticos-kit-orange.build.f_cpu=160000000L
ticos-kit-orange.build.flash_size=4MB
ticos-kit-orange.build.flash_freq=80m
ticos-kit-orange.build.flash_mode=qio
ticos-kit-orange.build.boot=qio
ticos-kit-orange.build.partitions=default
ticos-kit-orange.build.defines=

ticos-kit-orange.menu.CDCOnBoot.default=Disabled
ticos-kit-orange.menu.CDCOnBoot.default.build.cdc_on_boot=0
ticos-kit-orange.menu.CDCOnBoot.cdc=Enabled
ticos-kit-orange.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

ticos-kit-orange.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.default.build.partitions=default
ticos-kit-orange.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ticos-kit-orange.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ticos-kit-orange.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
ticos-kit-orange.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
ticos-kit-orange.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
ticos-kit-orange.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.minimal.build.partitions=minimal
ticos-kit-orange.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.no_ota.build.partitions=no_ota
ticos-kit-orange.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ticos-kit-orange.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ticos-kit-orange.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ticos-kit-orange.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ticos-kit-orange.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ticos-kit-orange.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ticos-kit-orange.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ticos-kit-orange.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ticos-kit-orange.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ticos-kit-orange.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.huge_app.build.partitions=huge_app
ticos-kit-orange.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ticos-kit-orange.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ticos-kit-orange.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ticos-kit-orange.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
ticos-kit-orange.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
ticos-kit-orange.menu.PartitionScheme.fatflash.build.partitions=ffat
ticos-kit-orange.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
ticos-kit-orange.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
ticos-kit-orange.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
ticos-kit-orange.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

ticos-kit-orange.menu.CPUFreq.160=160MHz (WiFi)
ticos-kit-orange.menu.CPUFreq.160.build.f_cpu=160000000L
ticos-kit-orange.menu.CPUFreq.80=80MHz (WiFi)
ticos-kit-orange.menu.CPUFreq.80.build.f_cpu=80000000L
ticos-kit-orange.menu.CPUFreq.40=40MHz
ticos-kit-orange.menu.CPUFreq.40.build.f_cpu=40000000L
ticos-kit-orange.menu.CPUFreq.20=20MHz
ticos-kit-orange.menu.CPUFreq.20.build.f_cpu=20000000L
ticos-kit-orange.menu.CPUFreq.10=10MHz
ticos-kit-orange.menu.CPUFreq.10.build.f_cpu=10000000L

ticos-kit-orange.menu.FlashMode.qio=QIO
ticos-kit-orange.menu.FlashMode.qio.build.flash_mode=dio
ticos-kit-orange.menu.FlashMode.qio.build.boot=qio
ticos-kit-orange.menu.FlashMode.dio=DIO
ticos-kit-orange.menu.FlashMode.dio.build.flash_mode=dio
ticos-kit-orange.menu.FlashMode.dio.build.boot=dio
ticos-kit-orange.menu.FlashMode.qout=QOUT
ticos-kit-orange.menu.FlashMode.qout.build.flash_mode=dout
ticos-kit-orange.menu.FlashMode.qout.build.boot=qout
ticos-kit-orange.menu.FlashMode.dout=DOUT
ticos-kit-orange.menu.FlashMode.dout.build.flash_mode=dout
ticos-kit-orange.menu.FlashMode.dout.build.boot=dout

ticos-kit-orange.menu.FlashFreq.80=80MHz
ticos-kit-orange.menu.FlashFreq.80.build.flash_freq=80m
ticos-kit-orange.menu.FlashFreq.40=40MHz
ticos-kit-orange.menu.FlashFreq.40.build.flash_freq=40m

